# Задайте список из N элементов, заполненных числами из промежутка [-N, N].
# Найдите произведение элементов на указанных позициях.
# Позиции вводятся с клавиатуры.

i = int(input('Введите число N: '))
a = int(input('Введите число N: '))
i = []
i.append(-1, 2)
print(i)